---
kind: property
id: P:Autodesk.Revit.UI.ExternalApplicationArray.Size
source: html/6fc838ae-9a11-9bde-139a-a79fd8f33c53.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.Size Property

Returns the number of objects that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```